Could not change type due to highlighted infilling element. 'Basic Ceiling' infills are only compatible with 'Basic Ceiling' hosts.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InfillNoThicknessCeiling { get; }
  Visual Basic
Public Shared ReadOnly Property InfillNoThicknessCeiling As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InfillNoThicknessCeiling {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures InfillFailures Class
  Autodesk.Revit.DB Namespace